In [3]:
import pandas as pd
items2 = [{'bikes':20,'pants':30,'watches':35},{'watches':10,'glasses':50,'bikes':15,'pants':5}]
store_items = pd.DataFrame(items2,index = ['store 1','store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [12]:
print('bikes\n',store_items[['bikes']])
print('bikes & pants\n',store_items[['bikes','pants']])
print('store1\n',store_items.loc[['store 1']])
print('bikes in store 2\n',store_items['bikes']['store 2'])
#column first and index

bikes
          bikes
store 1     20
store 2     15
bikes & pants
          bikes  pants
store 1     20     30
store 2     15      5
store1
          bikes  pants  watches  glasses
store 1     20     30       35      NaN
bikes in store 2
 15

In [14]:
store_items['shirts']=[15,2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [17]:
store_items['suits']=store_items['pants']+store_items['shirts']
store_items
#add a column

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [32]:
new_items = [{'bikes':20,'pants':30,'watches':35,'glasses':4}]
new_store = pd.DataFrame(new_items,index=['store 3'])
new_store
# to add a row, create a new df & append it

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [37]:
store_items = store_items.drop(['store 3'])
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [38]:
# We add a new column using data from particular rows in the watches column
store_items['new_watches'] = store_items['watches'][1:]

# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0